app/controllers/algos_controller.rb

SELECT "algos".* FROM "algos"
SELECT "algos".* FROM "algos" WHERE "algos"."fav" = ?  [["fav", "true"]]
---
  def index
    @algos = Algo.all
    @favorites = Algo.where(:fav => true)

SELECT  "algos".* FROM "algos" WHERE "algos"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @algo = Algo.find(params[:id])

SELECT  "algos".* FROM "algos" WHERE "algos"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @algo = Algo.find(params[:id])

INSERT INTO "algos" ("name", "algorithm", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @algo = Algo.new(algo_params)

    if @algo.save

SELECT  "algos".* FROM "algos" WHERE "algos"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "algos" SET "algorithm" = ?, "fav" = ?, "updated_at" = ? WHERE "algos"."id" = ?  [["algorithm", "FIBBBBBOOOONNNNNAAAACCCCCIIIIIII\r\n\r\n"], ["fav", "t"], ["updated_at", "2016-05-10 20:53:50.142565"], ["id", 3]]
---
  def update
    @algo = Algo.find(params[:id])
    if @algo.update(algo_params)

SELECT  "algos".* FROM "algos" WHERE "algos"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "algos" WHERE "algos"."id" = ?  [["id", 2]]
---
  def destroy
    @algo = Algo.find(params[:id])
    @algo.destroy